UltimateHackingKeyboard/bootloader/apps/bus_pal/MK65F18/src/command.c
/*
 * Copyright (c) 2013-2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "memory/memory.h"
#include "sbloader/sbloader.h"
#include "property/property.h"
#include "utilities/fsl_assert.h"
#include <string.h>
#include <stdint.h>
#include "command.h"
#include "packet/serial_packet.h"
#include "crc/crc16.h"
#include "utilities/fsl_rtos_abstraction.h"

#include "flash/fsl_flash.h"
#include "fsl_device_registers.h"

#if defined(ENABLE_USB)
#include "usb_class_hid.h"
#include "usb_device_stack_interface.h"
#include "usb_hid.h"
#include "bootloader_hid_report_ids.h"
#include "usb_error.h"
#include "usb_descriptor.h"
#include "usb_class_hid.h"
#endif

#include "bus_pal_hardware.h"

//! @addtogroup command
//! @{

////////////////////////////////////////////////////////////////////////////////
// Variables
////////////////////////////////////////////////////////////////////////////////

//! @brief Command processor state data.
command_processor_data_t g_commandData;
buspal_state_t g_buspalState = kBuspal_Idle;
uint8_t g_targetRxBuffer[64];

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

void handle_reset(uint8_t *packet, uint32_t packetLength);
void send_generic_response(uint32_t commandStatus, uint32_t commandTag);

static status_t handle_command_internal(uint8_t *packet, uint32_t packetLength);
static status_t handle_data(bool *hasMoreData);
static uint16_t calculate_framing_crc16(framing_data_packet_t *packet, const uint8_t *data);
static status_t handle_data_read(bool *hasMoreData);
static void handle_read_memory_command(uint8_t *packet, uint32_t packetLength);
static void finalize_data_phase(status_t status);
static void reset_data_phase();
static status_t peripheral_read(uint8_t *dest, uint32_t readLength);
static status_t peripheral_write(uint8_t *src, uint32_t writeLength);

////////////////////////////////////////////////////////////////////////////////
// Code
////////////////////////////////////////////////////////////////////////////////

void handleUsbBusPalCommand()
{
    g_commandData.state = kCommandState_CommandPhase;

    while (1)
    {
        bootloader_command_pump();
    }
}

static void handle_config_i2c(uint8_t *packet, uint32_t packetLength)
{
    configure_i2c_packet_t *command = (configure_i2c_packet_t *)packet;
    configure_i2c_address(command->address);
    configure_i2c_speed(command->speed);

    g_buspalState = kBuspal_I2c;

    send_generic_response(kStatus_Success, command->commandPacket.commandTag);
}

static void handle_config_spi(uint8_t *packet, uint32_t packetLength)
{
    configure_spi_packet_t *command = (configure_spi_packet_t *)packet;
    configure_spi_speed(command->speedKhz);
    configure_spi_settings((dspi_clock_polarity_t)command->polarity, (dspi_clock_phase_t)command->phase,
                           (dspi_shift_direction_t)command->direction);
    g_buspalState = kBuspal_Spi;

    send_generic_response(kStatus_Success, command->commandPacket.commandTag);

    // send ping to target and get response
    uint8_t header[2] = { kFramingPacketStartByte, kFramingPacketType_Ping };
    uint8_t response[10];
    uint8_t count = 32;
    peripheral_write(header, 2);
    do
    {
        peripheral_read(header, 1);
    } while ((header[0] != kFramingPacketStartByte) && (count-- != 0));
    peripheral_read(response, sizeof(ping_response_t) + 1);
}

static void handle_config_can(uint8_t *packet, uint32_t packetLength)
{
    configure_can_packet_t *command = (configure_can_packet_t *)packet;
    configure_can_speed(command->speed);
    configure_can_txid(command->txid);
    configure_can_rxid(command->rxid);

    g_buspalState = kBuspal_FlexCAN;

    send_generic_response(kStatus_Success, command->commandPacket.commandTag);
}

static void handle_read_memory_command(uint8_t *packet, uint32_t packetLength)
{
    read_memory_packet_t *command = (read_memory_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_commandData.dataPhase.count = command->byteCount;
    g_commandData.dataPhase.address = command->startAddress;
    g_commandData.dataPhase.commandTag = kCommandTag_ReadMemory;
}

static void handle_write_memory_command(uint8_t *packet, uint32_t packetLength)
{
    read_memory_packet_t *command = (read_memory_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_commandData.dataPhase.count = command->byteCount;
    g_commandData.dataPhase.address = command->startAddress;
    g_commandData.dataPhase.commandTag = kCommandTag_WriteMemory;
}

