UltimateHackingKeyboard/bootloader/apps/bus_pal/MK65F18/src/command.c
//! @brief Calculate crc over framing data packet.
static uint16_t calculate_framing_crc16(framing_data_packet_t *packet, const uint8_t *data)
{
    uint16_t crc16;

    // Initialize the CRC16 information
    crc16_data_t crcInfo;
    crc16_init(&crcInfo);

    // Run CRC on all header bytes besides the CRC field
    crc16_update(&crcInfo, (uint8_t *)&packet->header.startByte, sizeof(framing_data_packet_t) - sizeof(uint16_t));

    // Continue running CRC on any payload bytes
    crc16_update(&crcInfo, data, packet->length);

    // Finalize the CRC calculations
    crc16_finalize(&crcInfo, &crc16);

    return crc16;
}

static status_t peripheral_read(uint8_t *dest, uint32_t readLength)
{
    status_t status = kStatus_Success;

    switch (g_buspalState)
    {
        case kBuspal_I2c:
            status = receive_i2c_data(dest, readLength);
            break;
        case kBuspal_Spi:
            receive_spi_data(dest, readLength);
            break;
        case kBuspal_FlexCAN:
            read_can_data(dest, readLength);
            break;
        default:
            status = kStatus_Fail;
            break;
    }

    return status;
}

static status_t peripheral_write(uint8_t *src, uint32_t writeLength)
{
    status_t status = kStatus_Success;

    switch (g_buspalState)
    {
        case kBuspal_I2c:
            status = send_i2c_data(src, writeLength);
            break;
        case kBuspal_Spi:
            send_spi_data(src, writeLength);
            break;
        case kBuspal_FlexCAN:
            send_can_data(src, writeLength);
            break;
        default:
            status = kStatus_Fail;
            break;
    }

    return status;
}

static void finalize_data_phase(status_t status)
{
    uint8_t *rxBuf = (uint8_t *)g_targetRxBuffer;
    uint8_t rxSize = 0;
    framing_sync_packet_t sync;

    g_commandData.dataPhase.address = 0;
    g_commandData.dataPhase.count = 0;

    if (status == kStatus_Success)
    {
        // receiving framing paket header
        if (peripheral_read(rxBuf, sizeof(framing_data_packet_t)) != kStatus_Success)
        {
            status = kStatus_Fail;
        }
        else
        {
            rxSize = ((framing_data_packet_t *)rxBuf)->length;
            if (peripheral_read(rxBuf + sizeof(framing_data_packet_t), rxSize) != kStatus_Success)
            {
                status = kStatus_Fail;
            }
        }

        sync.header.startByte = kFramingPacketStartByte;

        if (status == kStatus_Fail)
        {
            sync.header.packetType = kFramingPacketType_Nak;
        }
        else
        {
            sync.header.packetType = kFramingPacketType_Ack;
        }

        // send Ack/Nak back to peripheral
        peripheral_write((uint8_t *)&sync, sizeof(framing_sync_packet_t));
    }

    // Send final response packet.
    send_generic_response(status, g_commandData.dataPhase.commandTag);
}

static status_t handle_data_read(bool *hasMoreData)
{
    if (g_commandData.dataPhase.count == 0)
    {
        // No data phase.
        *hasMoreData = false;
        finalize_data_phase(kStatus_Success);
        return kStatus_Success;
    }

    *hasMoreData = true;
    uint32_t remaining = g_commandData.dataPhase.count;
    uint32_t dataAddress = g_commandData.dataPhase.address;
    status_t status = kStatus_Success;
    framing_sync_packet_t sync;

    // Initialize the data packet to send.
    uint32_t packetSize;
    uint8_t packet[kMinPacketBufferSize];

    // Copy the data into the data packet.
    packetSize = MIN(kMinPacketBufferSize, remaining);

    // receiving framing paket header
    if (peripheral_read(packet, sizeof(framing_data_packet_t)) != kStatus_Success)
    {
        status = kStatus_Fail;
    }
    else
    {
        if (peripheral_read(packet, packetSize) != kStatus_Success)
        {
            status = kStatus_Fail;
        }
    }

    sync.header.startByte = kFramingPacketStartByte;

    if (status == kStatus_Fail)
    {
        sync.header.packetType = kFramingPacketType_Nak;
    }
    else
    {
        sync.header.packetType = kFramingPacketType_Ack;
    }

    // send Ack/Nak back to peripheral
    peripheral_write((uint8_t *)&sync, sizeof(framing_sync_packet_t));

    dataAddress += packetSize;

    if (status != kStatus_Success)
    {
        debug_printf(
            "Error: %s returned status 0x%x, abort data phase\r\n",
            (g_commandData.dataPhase.commandTag == kCommandTag_ReadMemory) ? "read memory" : "flash read resource",
            status);
        // Send zero length packet to tell host we are aborting data phase
        usb_hid_packet_write(&g_peripherals[0], (const uint8_t *)packet, 0, kPacketType_Data);
        finalize_data_phase(status);
        *hasMoreData = false;
        return kStatus_Success;
    }

    remaining -= packetSize;

    status = usb_hid_packet_write(&g_peripherals[0], (const uint8_t *)packet, packetSize, kPacketType_Data);

    if (remaining == 0)
    {
        finalize_data_phase(status);
        *hasMoreData = false;
    }
    else if (status != kStatus_Success)
    {
        debug_printf("writePacket aborted due to status 0x%x\r\n", status);
        finalize_data_phase(status);
        *hasMoreData = false;
    }
    else
    {
        g_commandData.dataPhase.count = remaining;
        g_commandData.dataPhase.address = dataAddress;
    }

    return kStatus_Success;
}

static status_t handle_data_write(bool *hasMoreData)
{
    serial_framing_packet_t framingPacket;

    if (g_commandData.dataPhase.count == 0)
    {
        // No data phase.
        *hasMoreData = false;
        finalize_data_phase(kStatus_Success);
        return kStatus_Success;
    }

    *hasMoreData = true;
    uint32_t remaining = g_commandData.dataPhase.count;
    uint32_t dataAddress = g_commandData.dataPhase.address;
    uint8_t *packet;
    uint32_t packetLength = 0;
    status_t status;

    framing_sync_packet_t sync;

    // read data packet
    status = usb_hid_packet_read(&g_peripherals[0], &packet, &packetLength, kPacketType_Data);
    if (status != kStatus_Success)
    {
        // Abort data phase due to error.
        debug_printf("consumer abort data phase due to status 0x%x\r\n", status);
        //        g_packetInterface->abortDataPhase(0);
        finalize_data_phase(status);
        *hasMoreData = false;
        return kStatus_Success;
    }

    if (packetLength == 0)
    {
        // Sender requested data phase abort.
        debug_printf("Data phase aborted by sender\r\n");
        //        finalize_data_phase(kStatus_AbortDataPhase);
        finalize_data_phase(kStatus_Success);
        *hasMoreData = false;
        return kStatus_Success;
    }

    packetLength = MIN(packetLength, remaining);

    // Convert to framing packet
    framingPacket.dataPacket.header.startByte = kFramingPacketStartByte;
    framingPacket.dataPacket.header.packetType = kFramingPacketType_Data;

