UltimateHackingKeyboard/bootloader/apps/bus_pal/MK65F18/src/command.c
    framingPacket.dataPacket.length = packetLength;

    // Copy the caller's data buffer into the framing packet.
    if (packetLength)
    {
        memcpy(framingPacket.data, packet, packetLength);
    }

    framingPacket.dataPacket.crc16 = calculate_framing_crc16(&framingPacket.dataPacket, (uint8_t *)framingPacket.data);

    // send framing packet to target peripheral
    if (peripheral_write((uint8_t *)&framingPacket, sizeof(framing_data_packet_t) + framingPacket.dataPacket.length) !=
        kStatus_Success)
    {
        status = kStatus_Fail;
    }
    // recering ACK from target peripheral
    else
    {
        uint8_t count = 32;
        do
        {
            if (peripheral_read((uint8_t *)&sync.header, 2) != kStatus_Success)
            {
                status = kStatus_Fail;
            }
            else
            {
                if ((sync.header.startByte != kFramingPacketStartByte) &&
                    (sync.header.packetType != kFramingPacketType_Ack))
                {
                    status = kStatus_Fail;
                }
                break;
            }
        } while ((sync.header.startByte != kFramingPacketStartByte) && (count-- != 0)); //
    }

    dataAddress += packetLength;
    remaining -= packetLength;

    if (remaining == 0)
    {
        finalize_data_phase(status);
        *hasMoreData = false;
    }
    else if (status != kStatus_Success)
    {
        debug_printf("writePacket aborted due to status 0x%x\r\n", status);
        finalize_data_phase(status);
        *hasMoreData = false;
    }
    else
    {
        g_commandData.dataPhase.count = remaining;
        g_commandData.dataPhase.address = dataAddress;
    }

    return kStatus_Success;
}

// See command.h for documentation on this function.
status_t bootloader_command_init()
{
    command_processor_data_t *data = g_commandInterface.stateData;

    data->state = kCommandState_CommandPhase;
    return kStatus_Success;
}

// See command.h for documentation on this function.
status_t bootloader_command_pump()
{
    status_t status = kStatus_Success;
    bool hasMoreData = false;
    command_packet_t *cmdPacket;
    uint8_t cmdTag;

    switch (g_commandData.state)
    {
        default:
        case kCommandState_CommandPhase:

            status = usb_hid_packet_read(&g_peripherals[0], &g_commandData.packet, &g_commandData.packetLength,
                                         kPacketType_Command);

            if (status != kStatus_Success)
            {
                debug_printf("Error: readPacket returned status 0x%x\r\n", status);
                break;
            }

            if (g_commandData.packetLength == 0)
            {
                // No command packet is available. Return success.
                break;
            }

            cmdPacket = (command_packet_t *)g_commandData.packet;
            cmdTag = cmdPacket->commandTag;

            // check command tag to see if there will be a dataphase
            if (cmdTag == kCommandTag_ConfigureI2c)
            {
                handle_config_i2c(g_commandData.packet, g_commandData.packetLength);
                break;
            }
            // check command tag to see if there will be a dataphase
            else if (cmdTag == kCommandTag_ConfigureSpi)
            {
                handle_config_spi(g_commandData.packet, g_commandData.packetLength);
                break;
            }
            // check command tag to see if there will be a dataphase
            else if (cmdTag == kCommandTag_ConfigureCan)
            {
                handle_config_can(g_commandData.packet, g_commandData.packetLength);
                break;
            }

            else if (cmdTag == kCommandTag_ReadMemory)
            {
                handle_read_memory_command(g_commandData.packet, g_commandData.packetLength);

                g_commandData.state = kCommandState_DataPhaseRead;
            }
            else if (cmdTag == kCommandTag_FlashReadResource)
            {
                g_commandData.state = kCommandState_DataPhaseRead;
            }
            else if (cmdTag == kCommandTag_ReceiveSbFile || cmdTag == kCommandTag_WriteMemory)
            {
                handle_write_memory_command(g_commandData.packet, g_commandData.packetLength);

                g_commandData.state = kCommandState_DataPhaseWrite;
            }

            status = handle_command_internal(g_commandData.packet, g_commandData.packetLength);
            if (status != kStatus_Success)
            {
                debug_printf("Error: handle_command returned status 0x%x\r\n", status);
                break;
            }

            break;

        case kCommandState_DataPhaseRead:
            status = handle_data_read(&hasMoreData);
            if (status != kStatus_Success)
            {
                g_commandData.state = kCommandState_CommandPhase;
                break;
            }
            g_commandData.state = hasMoreData ? kCommandState_DataPhaseRead : kCommandState_CommandPhase;
            break;

        case kCommandState_DataPhaseWrite:
            status = handle_data_write(&hasMoreData);
            if (status != kStatus_Success)
            {
                g_commandData.state = kCommandState_CommandPhase;
                break;
            }
            g_commandData.state = hasMoreData ? kCommandState_DataPhaseWrite : kCommandState_CommandPhase;
            break;

        case kCommandState_DataPhase:
            status = handle_data(&hasMoreData);
            if (status != kStatus_Success)
            {
                g_commandData.state = kCommandState_CommandPhase;
                break;
            }
            g_commandData.state = hasMoreData ? kCommandState_DataPhase : kCommandState_CommandPhase;
            break;
    }

    return status;
}

//! @brief Handle a command transaction.
static status_t handle_command_internal(uint8_t *packet, uint32_t packetLength)
{
    serial_framing_packet_t framingPacket;
    status_t status = kStatus_Success;

    uint8_t *rxBuf = (uint8_t *)g_targetRxBuffer;
    uint8_t rxSize = 0;

    framing_sync_packet_t sync;

    // Convert to framing packet
    framingPacket.dataPacket.header.startByte = kFramingPacketStartByte;
    framingPacket.dataPacket.header.packetType = kFramingPacketType_Command;
    // Only read, write memory, receive SB file and flash read resource will have data command type
    // Will add later
    framingPacket.dataPacket.length = packetLength;

    // Copy the caller's data buffer into the framing packet.
    if (packetLength)
    {
        memcpy(framingPacket.data, packet, packetLength);
    }

    framingPacket.dataPacket.crc16 = calculate_framing_crc16(&framingPacket.dataPacket, (uint8_t *)framingPacket.data);

    // send framing packet to target peripheral
    if (peripheral_write((uint8_t *)&framingPacket, sizeof(framing_data_packet_t) + framingPacket.dataPacket.length) !=
        kStatus_Success)
    {
        status = kStatus_Fail;
    }
    else // recering ACK from target peripheral
    {
        uint8_t count = 32;
        do
        {
            if (peripheral_read((uint8_t *)&sync.header.startByte, 1) != kStatus_Success)
            {
                status = kStatus_Fail;
                break;
            }
            else
            {
                if (sync.header.startByte == kFramingPacketStartByte)
                {
                    if (peripheral_read((uint8_t *)&sync.header.packetType, 1) != kStatus_Success)
                    {
                        status = kStatus_Fail;
                    }
                    else if (sync.header.packetType != kFramingPacketType_Ack)
                    {
                        status = kStatus_Fail;
                    }
                    else
                    {
                        // receiving framing paket header
                        if (peripheral_read(rxBuf, sizeof(framing_data_packet_t)) != kStatus_Success)
                        {
                            status = kStatus_Fail;
                        }
                        else
                        {
                            rxSize = ((framing_data_packet_t *)rxBuf)->length;
                            if (peripheral_read(rxBuf + sizeof(framing_data_packet_t), rxSize) != kStatus_Success)
                            {
                                status = kStatus_Fail;
                                sync.header.packetType = kFramingPacketType_Nak;
                            }
                            else
                            {
                                sync.header.packetType = kFramingPacketType_Ack;
                            }

                            // send Ack/Nak back to peripheral
                            peripheral_write((uint8_t *)&sync, sizeof(framing_sync_packet_t));
                        }
                    }
                    break;
                }
            }
        } while (count-- != 0); // really good??
    }

    if (status == kStatus_Success)
    {
        status =
            usb_hid_packet_write(&g_peripherals[0], rxBuf + sizeof(framing_data_packet_t), rxSize, kPacketType_Command);
    }

